#!/bin/bash
export ADBYBY=/usr/share/adbyby
export config=/etc/config
crontab=/etc/crontabs/root
cron=/etc/config/cron
alias echo_date='echo 【$(date +%Y年%m月%d日\ %X)】:'
  
until  
        echo "1.删除wget插件"
        echo "2.移除自动更新规则功能，web计划任务界面为可视化操控界面(新版pandorabox固件)"  
        echo "3.移除自动更新规则功能，web计划任务界面为一个框(常见界面需自己手打任务时间)"  
        echo "4.移除自动更新规则功能，web计划任务界面为可视化操控界面(非新版pandorabox固件)" 
        echo "5.删除脚本文件"		
        echo "6.退出菜单"  
		echo "请输入选择（1-6）" 
        read input  
        test $input = 6
        do  
            case $input in  
			1)  echo "#############################################################################"
      			opkg remove wget	
                echo "#############################################################################";;
            5)  echo "#############################################################################"
     		    rm -f $ADBYBY/adupdate.sh
				echo "删除成功"
                echo "#############################################################################";;				
            3)  echo "#############################################################################"
			    sed -i '/adupdate.sh/d' $crontab
                /etc/init.d/cron restart 
				echo "删除完成"
                echo "#############################################################################";;
            4)  echo "#############################################################################"
   		        echo 暂不支持自动删除计划任务
                echo 请手动删除计划任务
				echo "#############################################################################";;				
            2)  echo "#############################################################################"
			    echo 使用浏览器进入路由管理界面
				echo "在计划任务界面手动删除'adbyby规则更新'这个任务"
				echo 后期更新再支持自动删除，现只能手动
        	    echo "#############################################################################";;	
			6)
            esac  
        done  